@melinath 
Thanks for https://github.com/GoogleCloudPlatform/magic-modules/pull/10242, which now allows the creation of custom remote repositories.
However, the plan output of terraform still looks weird, as it still shows "public_repository" to be set :-(

```
# google_artifact_registry_repository.main["gcrio"] will be created
  + resource "google_artifact_registry_repository" "main" {
      + create_time      = (known after apply)
      + description      = "Remote Repo for pulling images from gcr.io and caching them"
      + effective_labels = (known after apply)
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "europe-west1"
      + mode             = "REMOTE_REPOSITORY"
      + name             = (known after apply)
      + project          = "sre-hybrisinfra-dev-4fc6"
      + repository_id    = "gcrio"
      + terraform_labels = (known after apply)
      + update_time      = (known after apply)

      + remote_repository_config {
          + description = "Remote Repo for pulling images from gcr.io and caching them"

          + docker_repository {
              + public_repository = "DOCKER_HUB"

              + custom_repository {
                  + uri = "https://gcr.io/"
                }
            }
        }
    }
```

Most probably because it is a pre apply script, that does the magic of wiping out public repository setting, or?
Any chance to fix this plan output as well?

Thanks and best regards,
Tim.